brew "age"
brew "bash"
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "docker"
brew "eza"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "graphviz"
brew "grep"
brew "imagemagick"
brew "jq"
brew "mas"
brew "mise"
brew "moreutils"
brew "neovim"
brew "openssh"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "sheldon"
brew "starship"
brew "tree"
brew "tmux"
brew "wget"
brew "zoxide"
brew "zsh"

cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"

cask "bitwarden"
cask "figma"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "mitmproxy"

mas "Anybox", id: 1593408455
mas "Bear", id: 1091189122
mas "The Unarchiver", id: 425424353

if ENV["HOMEBREW_DOTFILE_PERSONAL_DEVICE"] == "true" 
    cask "zed"

    mas "Budget Flow", id: 1640091876
    mas "DjVu Reader Pro", id: 895264364
    mas "Kindle", id: 302584613
    mas "paperLESS vTOKEN", id: 6667100978

    cask "anki"
    cask "cleanmymac"
    cask "iina"
    cask "netnewswire"
    cask "protonvpn"
    cask "transmission"
    cask "streamio"
else
    cask "visual-studio-code"

    vscode "eamodio.gitlens"
    vscode "EditorConfig.EditorConfig"
    vscode "monokai.theme-monokai-pro-vscode"
    vscode "sdras.night-owl"
    vscode "streetsidesoftware.code-spell-checker"
    vscode "usernamehw.errorlens"
    vscode "wayou.vscode-todo-highlight"
end

